
#Область ОбработчикиСобытий
// *****
//АKudryashova: Настройка представления
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Наименование");
	Поля.Добавить("ДействуетНаОсновании");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Данные.ДействуетНаОсновании) Тогда 
	
		СтандартнаяОбработка = Ложь;
		
		Представление = "" + Данные.Наименование + ", действует на оновании " + Данные.ДействуетНаОсновании;
		
	КонецЕсли;
	
КонецПроцедуры
// *****

#КонецОбласти
